{"keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_constraint": null, "trainable": true, "dtype": "float32", "filters": 32, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "name": "conv2d_1", "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_regularizer": null, "filters": 64, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "name": "conv2d_2", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 128, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 10, "activity_regularizer": null, "name": "dense_2"}}]}